package conn

import (
	"bytes"
	"encoding/binary"
	"fmt"
	"io"
	"net"
	"time"
)

const HEADER_LENGTH uint32 = 0x11
const LOGIN = 0xc9

var errorMsg = map[int32]string{
	-10004:  "你填入的米米號不存在！",
	-10012:  "使用了非法語言",
	-10023:  "你投的鮮花或泥巴已經超過了上限,明天再來吧！",
	-10025:  "這個小摩爾好像不歡迎你哦!",
	-10026:  "這個小摩爾在你的黑名單裡哦，你不能加他為好友呢！",
	-10512:  "這件寶貝現在還不能送給你哦！",
	-10913:  "今天你已經不能灑水或施肥\n了，休息下明天再來吧！",
	-10918:  "你今天不能再給SMC嚮導投票了！",
	-10972:  "你今天已經創建過一個派對了，明天再來吧！",
	-10991:  "你今天不能再送福氣了！",
	-11002:  "數據庫出錯！",
	-11105:  "這個位置沒有蛋哦！",
	-11111:  "你的拉姆表現很棒！明天一定要再來！只要堅持鍛煉5天，我會送你一台拉姆跑步機！",
	-11117:  "你的豆豆不足哦！",
	-11119:  "兌換物品數量不足哦！",
	-11130:  "你的寵物已經超過了上限！",
	-11140:  "你的拉姆在拉姆運動會上沒有獲得任何一項參賽勳章，不能領取運動獎杯哦！明年繼續努力吧！",
	-11170:  "你已經有五筆存款！",
	-11171:  "咳咳，我可不是零錢罐，低於1000摩爾豆的存款我是不接受的哦！請重新輸入存款金額...",
	-11172:  "這筆存款不可以中途取出哦！",
	-11173:  "這筆存款不存在哦！",
	-11174:  "這筆存款已存在哦！",
	-11175:  "無效的存款期限值！",
	-11190:  "你今天賣的東西超過上限啦，明天再來吧！",
	-11201:  "你的小屋家具超過上限！",
	-11301:  "你填入的米米號不存在！",
	-11311:  "這棵毛毛樹今天已經有了\n充足的水分和養料了，請明天再來吧！",
	-11313:  "他今天不能再接受更多的投票了！",
	-11810:  "伺服器上的派對已滿，你可以去其他伺服器試試哦！",
	-12503:  "你已經加入這個班級了,趕快進入班級看看吧！",
	-12504:  "班級不存在喔！",
	-12523:  "果實已經被摘取過啦！",
	-12526:  "這裡的動物還沒長大哦，你還不能收獲它們！",
	-12530:  "目前魚塘已經被鎖了，你釣不到任何魚哦！",
	-12531:  "你今天已經釣過魚了，不能太貪心哦，明天再來吧！",
	-12535:  "你的牧場太擁擠了，已經不能再養更多的動物了！",
	-12536:  "你的魚塘太擁擠了，已經不能再養更多的魚了！",
	-12537:  "你捕捉了太多這種小動物，不能再捕捉了！！",
	-12538:  "飼料房裡不能放下這麼多飼料哦！",
	-12539:  "你已經領過了獎品！",
	-12540:  "班級獎品已經領過了！",
	-12543:  "你已經報過名了！",
	-12544:  "已經接了任務！",
	-12545:  "還沒接任務！",
	-12546:  "已經完成任務！",
	-12548:  "對方分數太低，不能PK哦！",
	-12569:  "已經擁有了這輛車",
	-12582:  "太多人孵過了這個蛋啦！",
	-12583:  "你今天已經孵過蛋啦,讓別的小摩爾過來幫忙吧！",
	-12591:  "這個蛋已經快要孵化了，不能再孵了哦！",
	-12598:  "我這邊已經賣光了，下個整點再來吧！",
	-12599:  "你已經領過鈴鐺了！",
	-12600:  "牧場飼養的昆蟲達到上限！",
	-12602:  "牧場中只能有一個菲尼克斯！",
	-12603:  "牧場中養殖該類物種超過上限！",
	-12604:  "\t這棵植物被授粉超過上限了！",
	-12605:  "\t這棵植物還不能授粉！",
	-12606:  "\t你這隻蝴蝶今天已經太疲倦啦！",
	-12607:  "\t你身上已經沒有禮物了，快去聖誕屋領取後再來贈送吧!",
	-12609:  "\t\t你的壁爐中還沒有禮物呢，給別人送上一份禮物去吧，說不定你也會收到驚喜的！",
	-12610:  "你今天已經得到太多能量星啦，明天再來吧!",
	-12611:  "該植物狀態異常，無法進行施肥哦！",
	-12612:  "你好像還沒有化肥哦，快去梅森那裡看看吧！",
	-12613:  "這棵植物今天再施肥就會脫水了，要合理使用化肥！",
	-12615:  "\t你的拉姆已經擁有這個物品啦！",
	-12616:  "你的拉姆還沒有學完課程，或未通過考試哦！",
	-12618:  "你今天已經抽獎超過十次了，不能貪多哦！",
	-12619:  "你今天已經中獎10次了，運氣不錯，但不能貪多哦！",
	-12628:  "你的拉姆已經是第五階段了哦！",
	-12629:  "你的拉姆正在技能學習當中哦！",
	-12634:  "你的母奶牛今天已經擠過奶囉！明天再來看看吧！",
	-12635:  "你的母奶牛已經擠過 5 次奶啦！不能再擠奶了喲！",
	-12638:  "你的菜吃完了！",
	-12639:  "你的菜正在做！",
	-12640:  "沒有這道菜！",
	-12641:  "僱傭的僱員太多了！不能再僱傭了！",
	-12642:  "菜的數量到達上限！",
	-12643:  "不是系統拉姆！",
	-12644:  "菜還沒煮熟！",
	-12645:  "所有服務員都被解僱了，吃不了菜！",
	-12648:  "這道菜已經糊了！",
	-12656:  "你沒有足夠的食材做這道菜！",
	-12674:  "你已經擁有卡牌冊了，不能再次領取了哦。",
	-12682:  "你用外掛，以為我不知道？小心封你號哦！下次不能再這樣啦！",
	-12683:  "你今天已經不能再購買這個物品了,請明天再來吧！",
	-12690:  "你每天最多能獲得200個火焰紋章哦！明天再過來吧！",
	-12712:  "現在已經不能加課了，完成今天的教學安排準備考試吧！",
	-12718:  "現在到了中間休息時間，耐心等待下一輪競猜開始吧！",
	-12719:  "這一輪你已經猜過了，耐心等待結果吧！",
	-12720:  "今天已經聯誼過三次了，學生已經很累啦 ，明天再來吧。",
	-12721:  "今天已經和這間教室的學生聯誼過了，去別人的教室看看吧。",
	-12722:  "你還沒有招收學生哦，去拉姆教導處招收學生以後再過來吧。",
	-12723:  "兌換的數量不夠哦！",
	-12724:  "你今天已經給他送過苞子花囉！一天只能給一位摩爾送出一個苞子花哦！",
	-12725:  "你今天已經送出太多的苞子花囉！請明天再來贈送吧！",
	-12736:  "這隻動物已經吃了太多啦，明天再過來餵它吧。",
	-12737:  "你還沒有快快長脆脆酥，快去用點點豆買一些吧。",
	-12741:  "捕獲的聖光獸數量已經太多了！",
	-12758:  "這個天使已經成熟了，不能使用這個道具！",
	-12759:  "這個道具一個天使一天只能使用一次哦！",
	-12764:  "\t這個天使一定可以發生變異的，好好期待吧～",
	-12765:  "這隻天使已經變異啦，不需要再使用這個道具了。",
	-12768:  "這個天使的星級比較高哦，需要使用更高級的道具才能生效。",
	-12769:  "這個天使的變異機率已經提升過啦，不能再次使用道具了。",
	-12777:  "你的精力是滿的哦，不能再次使用道具了。",
	-16020:  "留言板上已經貼滿了留言！",
	-40001:  "你的米米號不存在！",
	-40002:  "這個神奇密碼是錯誤的，再試試吧！",
	-40003:  "這個神奇密碼是錯誤的，再試試吧！",
	-40004:  "你的神奇密碼已經過了有效期了！",
	-40005:  "這個神奇密碼已經無效啦！",
	-40006:  "這個神奇密碼已經被使用過啦！",
	-40007:  "這個神奇密碼是錯誤的，再試試吧！",
	-40008:  "這個神奇密碼是錯誤的，再試試吧！",
	-40009:  "寶箱裡的寶貝你已經都有啦！不能再擁有了哦！",
	-40010:  "這個神奇密碼是錯誤的，再試試吧！",
	-40011:  "寶箱好像有點問題喲！稍等一會再來試試吧！",
	-51001:  "這個禮物沒辦法給你喔!！",
	-51002:  "你輸入的神奇密碼不存在哦，檢查看看是不是輸入錯誤了呢？",
	-51003:  "你輸入的神奇密碼還沒有被開啟，請你撥打客服熱線查詢哦！",
	-51004:  "你輸入的神奇密碼不在有效期內，請你撥打客服熱線查詢哦！",
	-51005:  "你輸入的神奇密碼被凍結，請你撥打客服熱線查詢哦！",
	-51006:  "你輸入的神奇密碼已經使用過,無法兌換哦!",
	-51007:  "兌換失敗！",
	-51008:  "你的神奇密碼暫時不能使用哦！",
	-51009:  "領取物品達到上限！",
	-51010:  "一個號只能用一個兌換碼！",
	-51100:  "你輸入的神奇密碼不是在這裡兌換哦，請你去問問其地方看看吧！",
	-52013:  "這件寶貝已經購買完了哦！",
	-52015:  "你已經擁有這件物品，不要浪費摩爾金豆喲！",
	-52016:  "你已經擁有這件商品或這套商品某一部分，為避免重復，請重新選擇或單件購買！",
	-52017:  "你已經擁有這件商品或這套商品某一部分，為避免重復，請重新選擇或單件購買！",
	-52019:  "你已經擁有這件物品，不要浪費摩爾金豆喲！",
	-52021:  "你已經擁有這件物品，不要浪費摩爾金豆喲！",
	-52105:  "真可惜，你的金豆不足！",
	-52205:  "真可惜，你的摩爾金豆不足！",
	-100001: "你不能在這個場景變身！",
	-100002: "今天你已經兌換了許多禮物，不可以再兌換了哦，請你明天再來吧！",
	-100003: "你的好朋友已經擁有太多這樣禮品了,你可以選擇其它禮品送他！",
	-100004: "你已經領取過本月的SMC工資了，下個月再來吧!",
	-100012: "今天你得到太多摩爾豆了！",
	-100020: "你還沒有報名，快去火神山腳下報名吧！",
	-100024: "你已經領過了，不要太貪心哦！",
	-100025: "你已經領過了，不要太貪心哦！",
	-100030: "你真是個充滿戰鬥力的小摩爾啊！可是，今天已經挑戰超過30次了，休息下明天再來吧！",
	-100031: "今天你已經拿了很多卡片了，趕快去和其他隊的隊員交換吧！",
	-100032: "卡牌不能匹配！",
	-100034: "不能購買該物品!",
	-100042: "你今天已經領了2隻小羊了，記得好好照顧它們哦！",
	-100046: "拉姆已經回家了！",
	-100047: "今天已經送了太多！",
	-100048: "你今天已經送了太多禮物啦，歇一歇，明天再來吧！",
	-100053: "你還沒有參賽哦！",
	-100055: "你沒有足夠的螢火草！",
	-100056: "不能邀請你的好友到飛船上！",
	-100057: "你還沒有通過SMC駕駛員考試哦！",
	-100059: "不能太貪心哦，你已經領取過摩爾豆的獎勵了！",
	-100060: "為班級貢獻300分以上會有特殊獎勵哦，下次記得踴躍參加哦！",
	-100061: "你不是班長哦，只有班長才可以領取班級榮譽獎勵哦！",
	-100063: "不能太貪心哦，你已經領取過了！",
	-100066: "你還沒有超級拉姆哦！",
	-100067: "這個合成機的位置正在使用哦！",
	-100069: "百寶箱裡的材料還不夠加工需求哦，再仔細看一下吧。",
	-100071: "今天已經很辛苦了，明天繼續來合成吧！",
	-100072: "每次只能使用一個加工機的製作位置哦！",
	-100075: "你的糖果太多啦！糖果籃子裡最多只能裝滿200顆糖果哦！",
	-100078: "你已經做過此次問卷調查！",
	-100079: "你的超級拉姆正在彩虹姐姐那裡托管，所以不能召喚過來哦！",
	-100080: "你沒有漁網！",
	-100081: "你的漁網太破了，不能用了！",
	-100082: "你已經有漁網了！",
	-100085: "用戶的糖果不夠！",
	-100086: "你今天已經拿了5次糖果了！",
	-100090: "你的超級拉姆今天已經修理時光門5次啦，休息一下吧！",
	-100092: "每次查詢最多10個，超過了這個限制！",
	-100094: "你不能領取這件物品哦!",
	-100096: "你的養殖級別不夠！",
	-100097: "已經關門啦，下次再來吧!",
	-100101: "你已經show的太累了，明天再來吧！",
	-100102: "你今天已經買了很多了，明天再來吧！",
	-100104: "這個位置已經有蛋啦！",
	-100110: "已經有人在跳舞了！",
	-100112: "你已經釣了很多魚了，保持生態平衡，明天再來吧！",
	-100114: "你今天撿的錢夠多了！",
	-100115: "在你猶豫期間，這件年貨已經被別人搶購啦！機不可失，失不再來喲！",
	-100116: "你今天從別人家釣了太多的魚！",
	-100117: "你的精力真的太充沛了！但是年貨可是有限的！明天再來當攤主吧！",
	-100118: "\t你今天已經拿的太多了，明天再來吧！",
	-100121: "\t你已經擁有這個腳印啦！",
	-100122: "你的超級拉姆正在上課，所以不能召喚過來哦！",
	-100124: "今天已經索取很多線索了，自己動動腦筋吧！",
	-100125: "你還有任務沒完成，暫時不能接這個任務哦！",
	-100126: "你還沒有車庫，快去交通署找貝塔吧！",
	-100127: "你今天搬石頭已達到上限了，多多休息，改天再來吧！",
	-100129: "企鵝爸爸已經為你的企鵝蛋孵化過啦，明天再來吧！",
	-100144: "學會小水滴、小火苗、小樹苗技能後，再來領取禮包吧！",
	-100145: "這週你已經領取過該禮物了，不能太貪心哦！",
	-100150: "你的拉姆生病了，趕緊帶它去拉姆醫院看病吧！",
	-100166: "你拉姆現在狀態很不好，帶它回去吃點東西，洗個澡，然後再過來吧。",
	-100170: "你已經擁有土地證了！不能再領取了喲！",
	-100171: "今天發放的土地證到達上限了！明天再來看看吧！",
	-100172: "你還沒有土地證喲！",
	-100173: "今天開放時間已經過了！明天再來看看吧！",
	-100174: "你的餐廳不存在！",
	-100175: "這不是你的餐廳，此功能無效！",
	-100176: "你已經有餐廳了！",
	-100177: "你還沒有餐廳！",
	-100178: "這個餐廳不是你的！",
	-100179: "你的拉姆已經被僱傭了！",
	-100180: "你的餐廳等級太低了！",
	-100181: "沒有位置了！",
	-100182: "現在營業時間已經過了，快去好好休息吧！",
	-100185: "這套房型或者內部裝潢現在還不能建設哦。",
	-100186: "你還沒有達到這套房型或者內部裝潢的解鎖條件！",
	-100189: "拉姆沒有成長哦，快速成長溫泉的力量每天只能發動一次呢，明天再來試試吧！",
	-100197: "你已經拿了太多這個東西了",
	-100199: "你的操作不對哦！沒有獲得獎品！",
	-100202: "你已經領取過大禮包了！",
	-100203: "你的摩爾等級不夠，不能領取這個任務！",
	-100208: "現在已經放學了，明天再來上課吧！",
	-100216: "這個蛋已經被別人領走了，去別的地方找找看吧！",
	-100312: "你還沒有把圖片拼合完成，繼續調查吧！",
	-100313: "你已經領取過這個獎勵了，試著解開其他謎團吧！",
	-100327: "你今天還沒玩遊戲哦，趕快去玩吧！",
	-100353: "支配力達到最大 ",
	-100354: "你已經領取過這個獎勵了 ",
	-100361: "摩靈背包滿了！",
	-100363: "戰鬥已經結束",
	-100364: "不在活動時間內",
	-101117: "你的摩爾豆不夠囉！",
}

type Packet struct {
	Header *Header
	Data   []byte
}
type Header struct {
	Len     uint32
	Nonce   uint8
	Cmd     int32
	User    uint32
	ErrCode int32
}

type MoleConn struct {
	conn     net.Conn
	nonce    int
	user     uint32
	respChan map[int32](chan Packet)
	encrypt  bool
	quit     chan bool
}

func CRC(data []byte) int {
	var c byte = 0
	for _, v := range data {
		c = (c ^ v) & 255
	}
	return int(c)
}

func NewMoleConn(host string, user uint32, encrypt bool) (*MoleConn, error) {
	tcpconn, err := net.Dial("tcp", host)
	if err != nil {
		return nil, err
	}
	quit := make(chan bool, 1)
	moleconn := &MoleConn{
		conn:     tcpconn,
		user:     user,
		respChan: make(map[int32](chan Packet)),
		quit:     quit,
		nonce:    65,
		encrypt:  encrypt,
	}
	go moleconn.receive()
	return moleconn, nil
}

func (c *MoleConn) receive() {
	for {
		select {
		case <-c.quit:
			return
		default:
			hdr, err := c.readHdr()
			if err != nil {
				continue
			}
			resp := make([]byte, hdr.Len-HEADER_LENGTH)
			_, err = io.ReadFull(c.conn, resp)
			if err != nil {
				continue
			}
			// log.Printf("[socket] received %x\n", resp)
			if channel, ok := c.respChan[hdr.Cmd]; ok {
				channel <- Packet{hdr, resp}
				delete(c.respChan, hdr.Cmd)
			}
		}
	}
}

func (c *MoleConn) Close() error {
	c.quit <- true
	return c.conn.Close()
}

var key = []byte("^FStx,wl6NquAVRF@f%6\x00")
var keylen = len(key)

func encrypt(plain []byte) []byte {
	// log.Printf("[encrypt] plain[%d]: %x\n", len(plain), plain)
	plen := len(plain)
	cipher := make([]byte, plen+1)
	for i, ki := 0, 0; i < plen; i++ {
		cipher[i] = plain[i] ^ key[ki%keylen]
		ki++
		if ki == 22 {
			ki = 0
		}
	}
	for i := plen; i > 0; i-- {
		cipher[i] = cipher[i] | (cipher[i-1] >> 3)
		cipher[i-1] = byte((uint(cipher[i-1]) << 5) % 256)
	}
	cipher[0] = cipher[0] | 3
	// log.Printf("[encrypt] cipher[%d]: %x\n", len(cipher), cipher)
	return cipher
}

func decrypt(cipher []byte) []byte {
	// log.Printf("[decrypt] cipher[%d]: %x\n", len(cipher), cipher)
	plen := len(cipher) - 1
	plain := make([]byte, plen)
	ki := 0
	for i := 0; i < plen; i++ {
		plain[i] = byte(uint(cipher[i]>>5) | (uint(cipher[i+1])<<3)%256)
		plain[i] = plain[i] ^ key[ki%keylen]
		ki++
		if ki == 22 {
			ki = 0
		}
	}
	// log.Printf("[decrypt] plain[%d]: %x\n", len(plain), plain)
	return plain
}

func (c *MoleConn) updateNonce(len int, cmd int32, data []byte) {
	if cmd == LOGIN {
		return
	}
	tmp := c.nonce - (c.nonce / 7) + 147 + (len % 21) + (int(cmd) % 13) + CRC(data)
	c.nonce = tmp % 256
}

func (c *MoleConn) readHdr() (*Header, error) {
	hdr := &Header{}
	err := binary.Read(c.conn, binary.BigEndian, hdr)
	return hdr, err
}

func (c *MoleConn) sendHdr(hdr *Header, req any) ([]byte, error) {
	channel := make(chan Packet, 1)
	c.respChan[hdr.Cmd] = channel
	binary.Write(c.conn, binary.BigEndian, *hdr)
	binary.Write(c.conn, binary.BigEndian, req)
	packet := <-channel
	if packet.Header.ErrCode != 0 {
		return packet.Data, fmt.Errorf("mole error: %s", errorMsg[packet.Header.ErrCode])
	}
	return packet.Data, nil
}

func (c *MoleConn) SendCmd(cmd int32, req any) ([]byte, error) {
	var hdr *Header
	if c.encrypt {
		buf := &bytes.Buffer{}
		binary.Write(buf, binary.BigEndian, req)
		c.updateNonce(17+buf.Len(), cmd, buf.Bytes())
		hdr = &Header{
			Len:     uint32(buf.Len() + 1 + 17),
			Nonce:   byte(c.nonce),
			Cmd:     cmd,
			User:    c.user,
			ErrCode: 0,
		}
		req = encrypt(buf.Bytes())
	} else {
		hdr = &Header{uint32(binary.Size(req)) + HEADER_LENGTH, 1, cmd, c.user, 0}
	}
	data, err := c.sendHdr(hdr, req)
	if err != nil {
		return nil, err
	}
	if c.encrypt {
		data = decrypt(data)
	}
	time.Sleep(200 * time.Millisecond)
	return data, nil
}

func (c *MoleConn) SendRecv(cmd int32, req any, resp any) error {
	data, err := c.SendCmd(cmd, req)
	if err != nil {
		return err
	}
	err = binary.Read(bytes.NewReader(data), binary.BigEndian, resp)
	return err
}

func (c *MoleConn) SendHdrRecv(hdr *Header, req any, resp any) error {
	data, err := c.sendHdr(hdr, req)
	if err != nil {
		return err
	}
	err = binary.Read(bytes.NewReader(data), binary.BigEndian, resp)
	return err
}
